build/Request/GuardrailsRequestData.xml

<?xml version="1.0"?>
<soap:Envelope
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<soap:Body>
<ns:ProcessGuardrailsAPI xmlns:ns="urn:PegaRULES:SOAP:DemoServices:Services">
<ProcessGuardrailsAPIRequest>
<ApplicationName/>
<ApplicationName></ApplicationName>
<ApplicationVersion></ApplicationVersion>
<GuardrailComplianceScore></GuardrailComplianceScore>
<GuardrailsAPIStatus></GuardrailsAPIStatus>
<HighSeverityCount></HighSeverityCount>
<LowSeverityCount></LowSeverityCount>
<MediumSeverityCount></MediumSeverityCount>
<UnjustifiedHighSeverityCount></UnjustifiedHighSeverityCount>
<UnjustifiedLowSeverityCount></UnjustifiedLowSeverityCount>
<UnjustifiedMediumSeverityCount></UnjustifiedMediumSeverityCount>
<UnjustifiedSeverityCount></UnjustifiedSeverityCount>
</ProcessGuardrailsAPIRequest>
</ns:ProcessGuardrailsAPI>
</soap:Body>
</soap:Envelope>
